
import React, { useState } from 'react';
import style from "./style.module.css"

export default function Popup({open, setOpen}) {

    const handleOutsideClick = () => {
        setOpen(!open);
    };

    const handleInsideClick = (e) => {
        e.stopPropagation(); 
    };

    return (
        open && (
            <div className={style.outside} onClick={handleOutsideClick}>
                <div className={style.inside} onClick={handleInsideClick}>
                <div className={style.scrollContent}>
                כללים לבדיקת ראייה עם תרשים סנלן באורך 1 מטר:

הגדרה:
- הקפידו על תאורה טובה ועקבית בחדר.
- התקן את התרשים בגובה העיניים עבור האדם הנבדק.
- מדוד וסמן בדיוק מטר אחד מהתרשים כדי שהנבדק יעמוד.
נוהל בדיקה:
- בדוק כל עין בנפרד. כסה את העין שאינה בודקת עם אטם או מדבקה.
- התחל עם עין ימין, ולאחר מכן בדוק את עין שמאל.
- בקשו מהנבדק לקרוא את הקו הקטן ביותר שהוא יכול לראות בבירור.
ניקוד:
- רשמו את השורה הקטנה ביותר שהנבדק יכול לקרוא במדויק (לפחות 3 מתוך 5 אותיות נכונות).
- שימו לב לציון חדות הראייה המשויך לקו זה.
פרשנות:
- ראייה "רגילה" בגובה 1 מטר תהיה היכולת לקרוא את הקו השקול ל-6/6 (20/20) ראייה ב-6 מטרים.
- אם אדם יכול לקרוא רק קווים גדולים יותר, הראייה שלו נמוכה מהנורמלי למרחק זה.
הקלטת תוצאות:
- רשמו את התוצאות כשבר, כאשר המונה הוא 1 (מרחק הבדיקה) והמכנה הוא המרחק שבו יכול אדם עם ראייה תקינה לקרוא את הקו הזה.
שיקולים נוספים:
- אם הנבדק מרכיב עדשות מתקנות, בדוק גם איתם וגם בלעדיהם.
- עבור ילדים צעירים מאוד או אנשים לא מילוליים, שקול להשתמש במשחק התאמה עם האותיות או הסמלים במקום לבקש מהם לקרוא בקול.
קריטריוני הפניה:
- אם הנבדק אינו יכול לקרוא את הקו המקביל לראייה 6/12 (20/40) או טוב יותר, שקול להפנות אותו לבדיקת עיניים מקיפה.
מגבלות:
- זכרו, בדיקה זו מהווה כלי מיון ואינה תחליף לבדיקת עיניים מלאה.
- בדיקה זו בודקת בעיקר את חדות הראייה ואינה מעריכה היבטים אחרים של ראייה או בריאות העין.
היגיינה:
- נקה את החסימה או התיקון בין משתמשים.
- אם אתה משתמש בתרשים פיזי, נקה אותו באופן קבוע.
תיעוד:
- רשום את תאריך הבדיקה, תוצאות לכל עין, האם נעשה שימוש בעדשות מתקנות וכל תצפיות או קשיים במהלך הבדיקה.
                </div>
                                </div>
            </div>
        )
    )
}
